{
    "// main screen": "",
    "main_title": "Biblical Casting Lots",
    "pr16_33": "The lot is cast into the lap, but its every decision is from the LORD. (Proverbs 16:33)",
    "user_guide": "User guide",
    "mindset": "Mind setting",
    "past_history": "Past records",
    "// user guide screen": "",
    "when_to_use": "* When is it good to use it?\n\n",
    "when_to_use_content": "1) When you don't have enough time to pray, but you need to make a decision quickly, so you prayfully trust God to lead you to the best path\n\n2) You're not sure which direction is the best, even though you've prayed for enough time on your own\n\n3) When the Holy Spirit moves your heart to cast lots for a decision\n\n",
    "how_to_use": "* How to use the app\n\n",
    "htu1": "1) title: ",
    "htu1_content": "For what you cast lots? This is to make it easier to understand when you want to refer to the record later. If not set, it is automatically set to 'Untitled'.\n\n",
    "htu2": "2) items: ",
    "htu2_content": "This is what is written on each lot. A minimum of 2 and a maximum of 12 are possible.\n\n",
    "htu3": "3) lot type selection: ",
    "htu3_content": "You can choose the type you want among 7 types of lot shape: fallen leaves, petals, hearts, maple leaves, folded paper, tulips, and full collection. The default is tulip.\n\n",
    "htu4": "4) shuffling lots: ",
    "htu4_content": "You can shuffle lots as many times as you like. The position of the lot changes randomly. For reference, in my case, I have my own rule of shuffling 7 times and selecting the bottom lot, but you can set your own rules for this.\n\n",
    "htu5": "5) casting the remaining lot: ",
    "htu5_content": "You can end by casting only one lot, or you can cast all the other lots in turn to determine the order.\n\n",
    "htu6": "6) saving records to a file: ",
    "htu6_content": "You can save the contents of your previous records as a text (.txt) file. The file is saved as a 'saved_time.txt' file in the 'casting history' folder of the phone's internal storage space. You can check and use the file through the file manager. The exact location is,\n\n",
    "htu6_path": "/storage/emulated/0/\ncasting history/saved_time.txt\n\n",
    "caution": "* Caution\n\n",
    "caution_content": "Casting lots is an expression of earnest prayer to know God's will. Please be aware that if you do it habitually without earnest spiritual desire or prayer to know God's will, or if you do it as a joke, you may become spiritually insensitive and your relationship with God may become distant. However, if you do it together with earnest prayer, you will deeply experience God's love, you will shed tears of gratitude as you are moved by God's good and accurate guidance, and your love and faith in God will deepen.",
    "// mindset screen": "",
    "url_call_error": "Cannot load $_url!",
    "with_prayer": "Get ready with prayer!",
    "piper_title": "Pastor John Piper's\n<The Sovereignty of God>",
    "piper_video": "Watch sermon video",
    "piper_text": "Read the sermon",
    "mindset_prayer": "Mindset prayer",
    "prayer_content": "Heavenly Father, who created the heavens and the earth and governs them according to His will!\n\nAt this time, I am going to cast lots to know God's good will.\n\nThe Lord said that even a single sparrow could not be shot and fell to the ground without God's permission, the Lord who counts the hairs on our heads, and the Lord who told us not to be afraid because we are worth more than many sparrows (Mt.10:29-31), we cast lots, but I believe that God controls the decision on the content (Prov.16:33).\n\nNo matter what content comes out during this time, I will fully believe and obey it as God has guided me.\n\nIf I don't have that kind of faith, or if I think casting lots is not the right way in the New Testament era, I think it's more right to pray for a longer time and seek God's will instead of casting lots.\n\nI believe that when we pray for enough time, God reveals His will through His Word, through the Holy Spirit, through changes in the environment, through people's words, through dreams, or in various ways.\n\nI believe that casting lots is one of such diverse ways of God's revelation. I believe that it is a method that can be used when we truly want to know God's will not only in the Old Testament era, but also in the New Testament era.\n\nIf we want to know God's will by casting lots, I believe that we should do so after prepairing our mind and faith through sufficient time in prayer to accept as God's will and guidance, whatever lot comes out.\n\nHoly Spirit, please guide me in this time. Thank you and I pray in the name of Jesus. Amen!\n\n\n",
    "// past list screen": "",
    "delete_history_1": "Delete all records",
    "no_history_1": "There are currently no records to delete!",
    "delete_confirm": "Do you want to delete all records of casting lots?",
    "delete_history_2": "delete records",
    "save_history": "save records",
    "recent_result": "* Recent result *",
    "history_title": "title: ",
    "history_datetime": "datetime: ",
    "history_all_items": "items: ",
    "history_selected_items": "selected item: ",
    "past_results": "* Past results *",
    "// title & items screen": "",
    "delete_all": "Delete all",
    "nothing_to_delete": "There are currently no title or items to delete!",
    "delete_all_confirm": "Do you want to delete the current title and all items and rewrite them?",
    "title_items": "Title and items",
    "min_items": "You don't have to write a title, but please write at least two items.",
    "casting_lots_title": "* Title of casting lots *",
    "casting_lots_items": "   - Items of casting lots",
    "select_lot_type": "Select lot type",
    "input_title": "Input(Change) title:",
    "input_title_hint": "The title helps to differentiate!",
    "add": "add",
    "input_item": "Input item:",
    "min2_max12": "min 2, max 12!",
    "change_item": "Change(Delete) item:",
    "input_item_num": "Input item number!",
    "change": "change",
    "delete": "delete",
    "// settings screen": "",
    "settings": "Settings",
    "casting_lots": "Casting Lots",
    "select": "select",
    "// lot select screen": "",
    "lot_result": "Result of casting lots",
    "am": "am",
    "pm": "pm",
    "no_title": "Untitled",
    "cast_remaining": "Cast remaining lots",
    "shuffle": "shuffle",
    "no_item": "The items of casting lots haven't been decided yet!",
    "go_input_item": "Go to set items",
    "// backup screen": "",
    "no_history_2": "No record of casting lots!",
    "making_backup": "Creating backup file...",
    "date": "date",
    "time": "\ntime",
    "title": "\ntitle",
    "items": "\nitems",
    "selected": "\nselected",
    "saved": "The backup file has been saved to the 'casting history' folder!",
    "history_folder": "casting history/",
    "backup": "Backup",
    "backup_info": "It is saved as a 'saved_time.txt' file in the internal storage 'casting history' folder\n\n\n/storage/emulated/0/\ncasting history/saved_time.txt",
    "history_backup": "Casting history backup",
    "// delete db result screen": "",
    "confirm_delete": "Deleted!",
    "history_deleted": "All records of casting lots have been deleted!",
    "// lots screen": "",
    "fallenLeaves": "fallen leaves",
    "flower": "petals",
    "heart": "hearts",
    "mapleLeaf": "maple leaves",
    "paper": "folded papers",
    "tulip": "tulips",
    "mixed": "mixed",
    "// common to all screens": "",
    "start": "Start casting lots",
    "ok": "OK",
    "yes": "Yes",
    "no": "No",
    "title_item_setting": "Title item setting",
    "no_past_history": "There is no previous record!",
    "go_to_home_screen": "Go to home screen",
    "quit_app": "Quit the app",
    "quit_app_confirm": "Are you sure you want to quit the app?",
    "// sermon screen": "",
    "sermon": "Sermon",
    "thanks": "Source link address:\n\nhttps://www.desiringgod.org/messages/the-sovereignty-of-god-my-counsel-shall-stand-and-i-will-accomplish-all-my-purpose/excerpts/what-kind-of-jesus-do-you-worship\n\n\n",
    "estimated": "Estimated reading time: 5 minutes\n\n\n",
    "almighty": "What Kind of Jesus Do You Worship? (The Sovereignty of God)\n\n",
    "piper": "- Pastor John Piper -\n\n",
    "sermon_text": "God is sovereign over the most random things you can imagine. Proverbs 16:33, 'The lot is cast into the lap, but its every decision is from the Lord.' How would we say that today? We would say, 'The dice is rolled in Vegas, and every stopping of the dice with those numbers up is from God — all of them.' Or if you're playing Scrabble at home and stick your hand into the bag and pull out your letters, God decides what letters you get. When you play Uno, God decides.\n\nAnd lest you think that's trifling, try this: Jesus says in Matthew 10:29-30, 'Are not two sparrows sold for a penny?' In other words, they are utterly insignificant. 'And not one of them will fall to the ground apart from your Father. But even the hairs of your head are all numbered.' The roll of the dice in Vegas — every one of them — or in your board game at home or the tiny birds dying in a thousand forests are governed by God.\n\nThat's Jesus's way and Proverbs's way of saying there aren't any details too small for his control. If he were here today, he'd talk in terms of molecules. He'd say with R.C. Sproul, 'There's not one maverick molecule in the universe.' From worms in the ground to stars in the galaxy, God governs.\n\nTake the book of Jonah. You got a very big fish, and the Bible says that God commanded this fish to swallow Jonah. And the fish obeyed. So fish do God's bidding. If he says to them, 'Do this,' they do it. And he commanded a plant to grow up to give Jonah some shade, 'Plant, grow up.' It obeyed. Plants do the bidding of God. Then he commanded a worm to kill the plant to make Jonah hot and to scold him for his bad attitude about Nineveh. So the worm obeyed.\n\nI take this totally seriously. Bacteria, tsetse flies, murderous viruses all do God's bidding. They're not free any more than the worm or the whale or the plant that just 'happened' to grow up. God sees everything, and if anything is about to happen that he doesn't want to happen, he just says Stop. And it obeys. If it didn't stop, he didn't tell it to stop, which means he's got a plan for it. Or consider the stars. Isaiah 40:26,\n\nLift up your eyes on high and see:\n   who created these?\nHe who brings out their host by number,\n   calling them all by name;\nby the greatness of his might\n   and because he is strong in power,\n   not one is missing.\n\nWhy are stars where they are, doing what they do? He's mighty in power. That's why I'm totally not a naturalist. I see the fingers of God in the atom and in the galaxies all the time — every millisecond of history controlling everything. I don't know what kind of God that you have who may be folding his arms, sitting back, doing nothing, letting the world run rampant. That's just not the biblical God, and therefore not our God.\n\nIf he rules over the stars, how much more the weather, disasters, disease, disability, death! Psalm 147:15-18,\n\nHe sends out his command to the earth;\n   his word runs swiftly.\nHe gives snow like wool;\n   he scatters frost like ashes.\nHe hurls down his crystals of ice like crumbs;\n   who can stand before his cold?\nHe sends out his word, and melts them;\n   he makes his wind blow and the waters flow.\n\nI love living in Minnesota. Is that cold? That's God. You haven't felt cold yet, all you Californians who just arrived. Job 37:11-13,\n\nHe loads the thick cloud with moisture;\n   the clouds scatter his lightning.\nThey turn around and around by his guidance,\n   to accomplish all that he commands them\n   on the face of the habitable world.\nWhether for correction or for his land\n   or for love, he causes it to happen.\n\nI love how clear the Bible is about the sovereignty of God over the natural world. Snow, rain, cold, heat, wind are all the work of God. And when Jesus finds himself in the middle of a life-threatening, raging storm, he stands up and speaks two words, 'Be still!' (Mark 4:39) — and the wind stops and the waves go flat. He could have done it last Monday in New York City with the severe flooding. And if you say he couldn't have, I don't know what kind of Jesus you have.\n\nIs he alive? Is he reigning? Is he the same Jesus today? Of course he is, which means anytime, anywhere on the planet, any wind can be stopped with a word from heaven: Stop. And it would obey.\n\nAnd if he doesn't say it, he has purposes. There is no wind, there is no storm, there is no hurricane, there is no cyclone, there is no typhoon, there is no monsoon, there is no tornado over which Jesus cannot say, 'Be still!' without getting off his throne, and it will obey him. But if it blows, he intends it to blow and he has purposes for it that are better than avoiding it.\n\nThat's what I'd preach if I were in the middle of New York right now, with the long six-hour lines at the gas stations, and so many dead, and new bodies being found everywhere. I wouldn't preach, 'My God is helpless.' I would not. I would not take away the hope of these people by saying you don't have a God who can help you because he's just too weak to stop a storm. How could he control the storms of your life? How could he help you at all if he can't speak what Jesus spoke? I wouldn't preach that way. I don't preach that way. We don't believe that way. And so it is with all the sufferings of life, with all its losses and pains and groans.\n\nWe are having a conference at the North Campus on disability called, 'The Works of God: God's Good Design in Disability.' That kind of language could get you shot in some places. How dare we have a conference with such a title?\n\nSo here is one of the verses that the conference is built on: The Lord said to Moses in Exodus 4:11, when Moses got all uppity about being unable to speak good enough, 'Who has made man's mouth? Who makes him mute, or deaf, or seeing, or blind? Is it not I, the Lord?' The person I've heard quote that verse most often is John Knight, who has a blind son. He was born blind with no eyes. That's not easy. It wasn't easy. It isn't easy. We're not saying disability is easy. Life is not easy.\n\n'God ultimately decides whether we suffer, whether we live, or whether we die.'\nFirst Peter 4:19, 'Let those who suffer according to God's will entrust their souls to a faithful Creator.' First Peter 3:17, 'It is better to suffer for doing good, if that should be God's will, than for doing evil.' Suffering for doing good. God's will. Really? Yes. So whether we suffer from disability, or whether we suffer from the evil of others, or persecution, God ultimately decides whether we suffer, whether we live, or whether we die.\n\nConsider Deuteronomy 32:39, 'There is no god beside me; I kill and I make alive; I wound and I heal; and there is none that can deliver out of my hand.' Or James 4:13-15,\n\nCome now, you who say, 'Today or tomorrow we will go into such and such a town and spend a year there and trade and make a profit' — yet you do not know what tomorrow will bring. What is your life? For you are a mist that appears for a little time and then vanishes. Instead you ought to say, 'If the Lord wills, we will live and do this or that.'\n\nDo you have a plan to travel anytime soon? You may not get there, and if you don't, it wasn't God's plan. You may live until tomorrow, and if you don't, that wasn't his plan. It was his plan for you to go home. If the Lord wills, we will live. I will finish this sermon, if the Lord wills. If a wacko walks through the door and shoots me between the eyes, it was God's will. So be sure you don't say wrong things at the funeral; otherwise, my wife will stand up and correct you.\n\nThe roll of the dice, the fall of a bird, the crawl of a worm, the movement of the stars, the falling of snow, the blowing of wind, the loss of sight, the suffering of the saints, and the death of everybody — these are included in the word, 'I will accomplish all my purpose' (Isaiah 46:10).\n\n\n"
}