{
    "// main screen": "",
    "main_title": "성경적 제비뽑기",
    "pr16_33": "제비는 사람이 뽑으나\n모든 일을 작정하기는\n여호와께 있느니라.\n(잠16:33)",
    "user_guide": "이용 안내",
    "mindset": "마음 준비",
    "past_history": "이전 기록",
    "// user guide screen": "",
    "when_to_use": "* 언제 이용하면 좋은가?\n\n",
    "when_to_use_content": "1) 충분한 기도의 시간이 부족한데 빨리 결정을 내려야 해서 하나님께서 가장 좋은 길로 인도해 주시기를 기도하는 마음으로 믿고 맡길 때\n\n2) 나름대로 충분한 시간 기도했는데도 어느 방향이 최선인지 하나님의 뜻을 잘 모르겠을 때\n\n3) 성령님께서 제비뽑기로 결정하도록 마음에 감동을 주실 때\n\n",
    "how_to_use": "* 앱 사용법\n\n",
    "htu1": "1) 제목: ",
    "htu1_content": "무엇을 결정하기 위한 제비뽑기인가? 나중에 기록을 참고하고자 할 때 쉽게 이해가 되도록 하기 위한 것입니다. 설정하지 않으면 자동으로 '제목 없음'이라고 설정됩니다.\n\n",
    "htu2": "2) 항목: ",
    "htu2_content": "각 제비에 쓰여지는 내용입니다. 최소 2개, 최대 12개까지 가능합니다.\n\n",
    "htu3": "3) 제비모양 선택: ",
    "htu3_content": "낙엽, 꽃잎, 하트, 단풍잎, 접은 종이, 튜울립, 전체모음 등 7가지 제비모양 중 원하시는 제비모양을 선택하실 수 있습니다. 기본값은 튤립입니다.\n\n",
    "htu4": "4) 제비 섞어주기: ",
    "htu44_content": "원하는 횟수만큼 제비를 섞어줄 수 있습니다. 제비의 위치가 랜덤으로(임의로) 변합니다. 참고로 저의 경우 7번 섞어주고 가장 아래쪽에 나오는 제비를 선택한다는 저만의 규칙이 있는데 이는 각자 자기만의 규칙을 정해서 하시면 됩니다.\n\n",
    "htu5": "5) 남은 제비도 뽑기: ",
    "htu5_content": "1개의 제비만 뽑고 끝낼 수도 있고, 나머지 제비도 모두 차례로 뽑아서 순서를 정할 수도 있습니다.\n\n",
    "htu6": "6) 제비뽑기 기록을 파일로 저장하기: ",
    "htu6_content": "이전 기록에 있는 내용을 텍스트(.txt) 파일로 저장하실 수 있습니다. 파일은 핸드폰 내부 저장 공간의 '제비뽑기 기록' 폴더에 '저장시간.txt' 파일로 저장됩니다. 파일관리자를 통해 확인하시고 파일을 이용하실 수 있습니다. 정확한 위치는,\n\n",
    "htu6_path": "/storage/emulated/0/\n제비뽑기 기록/저장시간.txt\n\n",
    "caution": "* 주의사항\n\n",
    "caution_content": "제비뽑기는 하나님의 뜻을 알고자 하는 간절한 기도의 표현입니다. 하나님의 뜻을 알고자 하는 간절한 영적 소원이나 기도 없이 습관적으로 하시거나, 장난처럼 하시면, 영적으로 둔감해지고, 하나님과의 관계가 소원해질 수 있음을 주의하시기 바랍니다. 그러나 간절한 기도와 함께 하신다면 하나님의 사랑을 깊이 체험하게 되고, 하나님의 선하시고 정확하신 인도하심에 감격하여 감사의 눈물을 흘리게 될 것이며, 하나님께 대한 사랑과 믿음이 더욱 깊어질 것입니다.",
    "// mindset screen": "",
    "url_call_error": "$_koUrl을(를) 불러올 수 없습니다!",
    "with_prayer": "기도로 준비하기!",
    "piper_title": "존 파이퍼 목사님의\n<전능자와 제비뽑기>",
    "piper_video": "설교 동영상 보기",
    "piper_text": "설교문 읽기",
    "mindset_prayer": "마음 준비 기도",
    "prayer_content": "천지만물을 창조하시고 그 뜻대로 주관하시는 하나님 아버지!\n\n이 시간 하나님의 선하신 뜻을 알고자 제비뽑기를 하고자 합니다.\n\n참새 한 마리가 사냥군의 총에 맞아 땅에 떨어지는 것조차도 하나님의 허락하심이 없이는 될 수 없다고 하신 주님, 우리의 머리털까지 다 세고 계신 주님, 우리가 많은 참새보다 귀하므로 두려워말라고 하신 주님(마10:29-31), 우리가 제비를 뽑지만 그 내용의 결정은 하나님께서 주관하시는 줄 믿습니다(잠16:33).\n\n이 시간 어떤 내용이 나오든 하나님께서 인도하신 것으로 온전히 믿고 순종하겠습니다.\n\n만약 저에게 그러한 믿음이 없다면, 또는 제비뽑기가 신약시대에는 옳지 않은 방법이라고 생각한다면, 이를 하지 않고 더 오랜 시간 기도하며 하나님의 뜻을 찾아가는 것이 더 옳다고 생각합니다.\n\n하나님께서는 충분한 시간 기도할 때 말씀을 통하여, 성령님을 통하여, 환경의 변화를 통하여, 사람들의 말을 통하여, 꿈을 통하여 또는 다양한 방법으로 하나님의 뜻을 계시하시는 줄 믿습니다.\n\n제비뽑기는 그러한 다양한 하나님의 계시 방법 중 하나임을 믿습니다. 구약시대 뿐만 아니라 신약시대에도 진실되게 하나님의 뜻을 알고자 할 때 사용할 수 있는 방법임을 믿습니다.\n\n제비뽑기를 통해 하나님의 뜻을 알고자 한다면, 충분한 시간의 기도를 통해 어떤 제비가 나오든 하나님의 뜻과 인도하심으로 받아들일 마음의 준비, 믿음의 준비가 된 후에 하는 것이 옳은 줄 믿습니다.\n\n성령님, 이 시간 친히 인도하소서. 감사하며 예수님의 이름으로 기도합니다. 아멘!\n\n\n",
    "// past list screen": "",
    "delete_history_1": "제비뽑기 기록 삭제",
    "no_history_1": "현재 삭제할 제비뽑기 기록이 없습니다!",
    "delete_confirm": "그 동안의 제비뽑기 기록을 모두 삭제하기 원하세요?",
    "delete_history_2": "기록 삭제",
    "save_history": "기록 저장",
    "recent_result": "* 최근 제비뽑기 결과 *",
    "history_title": "제목: ",
    "history_datetime": "일시: ",
    "history_all_items": "전체 항목: ",
    "history_selected_items": "뽑힌 항목: ",
    "past_results": "* 이전 제비뽑기 기록 *",
    "// title & items screen": "",
    "delete_all": "전체 삭제",
    "nothing_to_delete": "현재 삭제할 제목이나 항목이 없습니다!",
    "delete_all_confirm": "현재 작성하신 제비뽑기 제목과 항목 전체를 삭제하고 다시 작성하기 원하세요?",
    "title_items": "제목과 항목",
    "min_items": "제목은 안쓰셔도 괜찮지만 항목은 최소 2개 이상 써 주세요",
    "casting_lots_title": "* 제비뽑기 제목 *",
    "casting_lots_items": "   - 제비뽑기 항목들",
    "select_lot_type": "제비모양 선택",
    "input_title": "제비뽑기 제목 입력(변경):",
    "input_title_hint": "제목 있으면 나중에 구분하기 좋음!",
    "add": "추가",
    "input_item": "제비뽑기 항목 입력:",
    "min2_max12": "최소 2개, 최대 12개 가능!",
    "change_item": "항목 변경(삭제):",
    "input_item_num": "항목 번호 입력!",
    "change": "변경",
    "delete": "삭제",
    "// settings screen": "",
    "settings": "설정",
    "casting_lots": "제비뽑기",
    "select": "선택",
    "// lot select screen": "",
    "lot_result": "제비뽑기 결과",
    "am": "오전",
    "pm": "오후",
    "no_title": "제목 없음",
    "cast_remaining": "남은 제비도 뽑기",
    "shuffle": "제비섞기",
    "no_item": "제비뽑기 항목을\n아직 정하지 않았습니다!",
    "go_input_item": "제비뽑기 항목 정하러 가기",
    "// backup screen": "",
    "no_history_2": "제비뽑기 기록이 없습니다!",
    "making_backup": "백업 파일 생성중...",
    "date": "날짜",
    "time": "\n시간",
    "title": "\n제목",
    "items": "\n전체 항목",
    "selected": "\n뽑힌 항목",
    "saved": "백업 파일이 '제비뽑기 기록' 폴더에 저장 되었습니다!",
    "history_folder": "제비뽑기 기록/",
    "backup": "백업",
    "backup_info": "내부 저장 공간의\n'제비뽑기 기록' 폴더에\n'저장시간.txt' 파일로 저장됩니다.\n\n/storage/emulated/0/\n제비뽑기 기록/저장시간.txt",
    "history_backup": "제비뽑기 기록 백업",
    "// delete db result screen": "",
    "confirm_delete": "삭제 확인",
    "history_deleted": "제비뽑기 기록이\n모두 삭제되었습니다!",
    "// lots screen": "",
    "fallenLeaves": "낙엽",
    "flower": "꽃잎",
    "heart": "하트",
    "mapleLeaf": "단풍잎",
    "paper": "접은 종이",
    "tulip": "튤립",
    "mixed": "전체 모음",
    "// common to all screens": "",
    "start": "제비뽑기 시작하기",
    "ok": "확인",
    "yes": "예",
    "no": "아니오",
    "title_item_setting": "제목 항목 설정",
    "no_past_history": "이전 제비뽑기 기록이\n없습니다!",
    "go_to_home_screen": "시작화면으로 돌아가기",
    "quit_app": "앱 종료",
    "quit_app_confirm": "앱을 종료하시겠습니까?",
    "// sermon screen": "",
    "sermon": "전능자와 제비뽑기 설교문",
    "thanks": "한글자막번역을 제공해 주신 기독교 유튜브 채널 '갓워드(GODWARD)'에 감사드립니다! 이 문장을 탭하시면 '갓워드' 유튜브 채널로 연결됩니다.\n\n",
    "estimated": "예상 읽는 시간: 5분\n\n\n",
    "almighty": "전능자와 제비뽑기\n\n",
    "piper": "- 존 파이퍼 목사님 -\n\n",
    "sermon_text": "하나님은 여러분이 상상할 수 있는 가장 무작위한 일들에도 주권을 가지십니다. 잠언 16장 33절입니다. '제비는 사람이 뽑으나 모든 일을 작정하기는 여호와께 있느니라.' 현대식으로 표현하면 어떻게 말할 수 있을까요? '라스베가스에서 주사위를 굴릴지라도 어떤 숫자에서 멈출지에 대한 모든 결정은 하나님이 하신다'. 또는 '당신이 스크래블(Scrabble) 게임(알파벳이 새겨진 타일을 보드 위에 가로나 세로로 단어를 만들어 내면 점수를 얻게 되는 방식의 보드 게임) 중에 주머니에서 글자를 꺼낼지라도 당신이 잡을 글자를 결정하시는 분은 하나님이시다'. '당신이 카드 게임을 할 때도 하나님께서 결정하신다'.\n\n이 사실을 대수롭지 않게 생각하지 않도록, 들어보세요. 예수님의 말씀입니다. '참새 두 마리가 한 앗사리온에 팔리지 않느냐' 즉, 참새는 전혀 대수롭지 않은 존재입니다. '그러나 너희 아버지께서 허락하지 아니하시면 그 하나도 땅에 떨어지지 아니하리라. 너희에게는 머리털까지 다 세신 바 되었나니' (마태복음 10:29-30) 라스베가스에서 굴리는 모든 주사위와 여러분이 집에서 하는 보드 게임과 수많은 숲에서 지극히 작은 새가 생명을 잃는 것은 하나님의 통제 가운데 있습니다.\n\n예수님과 잠언의 말씀은 너무 작고 사소하여 하나님의 통제 밖에 있는 것은 없다고 말합니다. 예수님께서 오늘 이 자리에 계셨다면 R.C.스프롤처럼 말하셨을 것입니다. '제멋대로 돌아다니는 분자는 이 우주에 단 하나도 없다'. 땅속의 벌레에서 은하계의 별들까지 하나님이 다스리고 계십니다.\n\n요나서를 보세요. 하나님께서 어마한 크기의 물고기에게 요나를 삼키라고 명령하십니다. 그리고 이 물고기는 하나님의 명령에 복종합니다. 말씀을 하시면 물고기들이 따릅니다. 또한 하나님께서는 요나를 위해서 식물이 자라도록 명령하셨습니다. 그분께서 자라도록 명령하시니 식물이 자랐습니다. 식물도 하나님의 명령을 따릅니다. 그후에 그분께서 벌레를 명하여 식물을 갉아먹게 하셔서 요나의 온몸이 뜨겁게 하시고 그 사건을 통해 니느웨에 대한 그의 잘못된 태도를 책망하셨습니다. 이번에는 벌레가 복종합니다.\n\n저는 이 사실을 매우 진지하게 생각합니다. 박테리아, 흡혈성 파리, 살인적인 바이러스가 하나님의 명령을 따릅니다. 그것들은 벌레나 고래나 어느 순간 자라게 된 식물보다 자유롭지 않습니다. 하나님께서는 모든 것을 살피십니다. 그리고 그분께서 어떤 일이 일어나기를 원하지 않으신다면 '멈추어라'고 말씀만 하셔도 그대로 시행됩니다. 멈추지 않았다면, 하나님께서 중단을 명령하지 않으신 것이고, 그 일에는 하나님의 계획이 있다는 뜻입니다. 별들을 생각해 봅시다.\n\n'너희는 눈을 높이 들어 누가 이 모든 것을 창조하였나 보라. 주께서는 수효대로 만상을 이끌어 내시고 그들의 모든 이름을 부르시나니 그의 권세가 크고 그의 능력이 강하므로 하나도 빠짐이 없느니라.' (이사야 40:26)\n\n왜 지금 별들이 그곳에 있고 자신의 역할을 하는 것인가요? 그분의 권세가 크시기 때문입니다. 이것이 제가 결코 자연주의자가 아닌 이유입니다. 저는 원자에서 은하계에 이르기까지 그 모든 것을 통제하고 계시는 하나님의 손을 매시간, 역사의 매순간 보게 됩니다. 여러분의 하나님은 팔짱을 낀 채 앉아서 아무 것도 하지 않으시고 세상이 제멋대로 굴러가도록 내버려 두시는 하나님인가요? 그것은 성경의 하나님이 아닙니다. 따라서 우리의 하나님이 아닙니다.\n\n그분께서 별들을 주관하시는데, 하물며 날씨와 재난과 질병과 장애와 죽음은 다를까요? 시편 147편 15절입니다.\n\n'그의 명령을 땅에 보내시니 그의 말씀이 속히 달리는도다. 눈을 양털 같이 내리시며 ...' (시편 147:15-16) 지난 주 스모키 마운틴에 40인치의 눈이 쌓였습니다. 하나님이 하셨지요. '우박을 떡 부스러기 같이 뿌리시나니 누가 능히 그의 추위를 감당하리요' (시편 147:17)\n\n저는 미네소타에서 사는 것이 좋습니다. 많이 추운 곳이지요? 하나님의 추위입니다. 캘리포니아에 사시는 분들은 아직 그 추위를 느껴보지 못하셨지요. '그의 말씀을 보내사 그것들을 녹이시고 바람을 불게 하신즉 물이 흐르는도다.' (시편 147:18) 시편 147편이었습니다. 욥기 37장은 이렇게 말합니다.\n\n'또한 그는 구름에 습기를 실으시고 그의 번개로 구름을 흩어지게 하시느니라. 그는 감싸고 도시며 그들의 할 일을 조종하시느니라. 그는 땅과 육지 표면에 있는 모든 자들에게 명령하시느니라. 혹은 징계를 위하여 혹은 땅을 위하여 혹은 긍휼을 위하여 그가 이런 일을 생기게 하시느니라.' (욥기 37:11-13)\n\n저는 자연 세계에 대한 하나님의 주권을 이토록 분명히 선포하는 성경을 사랑하지 않을 수 없습니다. 눈과 비와 추위와 더위와 바람은 모두 하나님께서 하신 일입니다. 예수님은 살인적인 격렬한 폭풍 가운데서 일어나 한마디 말씀을 하셨습니다. '잠잠하라' 그러자 바람이 그치고 파도가 잠잠해졌습니다. 그분은 지난 월요일 뉴욕에서 그렇게 하실 수도 있었습니다. 여러분이 그럴 수 없었다고 말하신다면 그 예수님은 제가 모르는 분입니다.\n\n그분은 살아 계신가요? 통치하고 계신가요? 지금도 같은 예수님인가요? 당연히 그렇습니다. 따라서 언제 어디서나 하늘에 계시는 분께서 한 마디의 말로 바람을 멈추실 수 있습니다. '그치거라' 그러면 바람이 순종합니다.\n\n만약 그렇게 말씀하지 않으신다면 목적이 있으신 것입니다. 예수님이 '잠잠하라'고 말씀하실 수 없는 바람, 폭풍, 허리케인, 사이클론, 태풍, 계절풍, 토네이도는 없습니다. 보좌를 떠나실 필요 없이 명령만 하시면 그것들이 순종할 것입니다. 하지만 그것들이 불어온다면 그분이 그렇게 의도하신 것이고 그 일을 막는 것보다 더 나은 목적이 있으신 것입니다.\n\n제가 뉴욕의 중심에 있다고 하여도 이 사실을 전파할 것입니다. 기름을 넣기 위해 6시간 동안 주유소에서 차들이 줄 서 있고, 98명 이상의 사람들이 목숨을 잃고, 도처에 새로운 시신이 발견되는 그곳에서 이렇게 설교하지 않을 것입니다. '우리의 하나님은 무력합니다'. 저는 그들의 소망을 빼앗는 말을 하지 않을 것입니다. '당신을 도울 수 있는 하나님은 없다. 그는 폭풍을 막기에 너무 약하기 때문이다. 그가 어떻게 네 인생의 풍파를 다스릴 수 있겠는가? 그가 예수가 말한 것처럼 명령할 수 없는데 어떻게 당신을 도울 수 있겠는가?' 그런 식의 설교는 하지 않을 것입니다. 그런 설교는 하지 않습니다. 우리는 그런 식으로 믿지 않습니다. 따라서 하나님의 주권은 삶의 모든 고난과 상실과 신음 속에서도 유효합니다.\n\n여호와께서 모세에게 말씀하셨습니다. 이 말씀을 읽기 전에 노스 캠퍼스에서 열리는 장애에 관한 컨퍼런스에 여러분을 초대하고 싶습니다. 제목은 '하나님의 일, 장애 속에서의 하나님의 선하신 계획' 입니다. 어디서 이런 말을 하면 총에 맞아 죽을지도 모릅니다. '장애 속에서의 하나님의 선하신 계획' 어떻게 감히 이런 제목으로 컨퍼런스를 열 수 있을까요? 참석해서 알아보세요.\n\n컨퍼런스의 토대가 되는 말씀 중 하나가 이것입니다. 출애굽기 4장 11절에서 여호와께서 모세에게 말씀하십니다. 모세가 자신의 말이 서툴다며 끝까지 발뺌하려고 할 때 여호와께서 모세에게 말씀하셨습니다. '여호와께서 그에게 이르시되 누가 사람의 입을 지었느냐? 누가 말 못 하는 자나, 못 듣는 자나, 눈 밝은 자나, 맹인이 되게 하였느냐? 나 여호와가 아니냐?' (출애굽기 4:11) 저는 존 나이트에게서 이 말씀을 가장 많이 들었습니다. 그의 아들은 시각 장애인입니다. 날 때부터 앞을 보지 못했어요. 쉬운 일이 아닙니다. 쉽지 않았습니다. 만만한 일이 아닙니다. 장애가 손쉽다고 말하는 것이 아닙니다. 인생은 만만하지 않습니다.\n\n베드로전서 4장입니다. '그러므로 하나님의 뜻대로 고난을 받는 자들은 ... 그 영혼을 미쁘신 창조주께 의탁할지어다.' (베드로전서 4:19) 베드로전서 3장 17절입니다. '선을 행함으로 고난 받는 것이 하나님의 뜻일진대 악을 행함으로 고난 받는 것보다 나으니라.' 선을 행함으로 고난을 받는 것은 하나님의 뜻입니다. 정말인가요? 그렇습니다. 따라서 우리가 장애로 고통을 겪든, 타인의 악으로 고통을 겪든, 박해로 고난을 당하든, 하나님께서 궁극적으로 우리의 고통과 생사 여부를 결정하십니다.\n\n신명기 32장 39절을 들어보십시오. '... 나 외에는 신이 없도다. 나는 죽이기도 하며 살리기도 하며, 상하게도 하며 낫게도 하나니, 내 손에서 능히 빼앗을 자가 없도다.' 야고보서 4장 13절도 보십시오.\n\n'들으라 너희 중에 말하기를 오늘이나 내일이나 우리가 어떤 도시에 가서 거기서 일 년을 머물며 ... 이익을 보리라 하는 자들아. 내일 일을 너희가 알지 못하는도다. 너희 생명이 무엇이냐? 너희는 잠깐 보이다가 없어지는 안개니라. 너희가 도리어 말하기를 주의 뜻이면 우리가 살기도 하고 이것이나 저것이나 하리라 할 것이거늘' (야고보서 4:13-15)\n\n월요일에 덜루스로 갈 계획이신가요? 어쩌면 가지 못할 것입니다. 그렇게 된다면, 그곳에 가는 것은 하나님의 계획이 아니었습니다. 여러분은 월요일까지 살지 못할 수도 있습니다. 그렇다면, 그때까지 사는 것이 하나님의 계획이 아니었습니다. 여러분이 집(천국)으로 가는 것이 그분의 계획이었습니다. 주님의 뜻이라면 우리는 살 것입니다. 주님의 뜻이라면 이 설교를 마칠 것입니다. 제정신이 아닌 누군가가 문을 열고 들어와 제 미간에 총을 쏜다면, 하나님의 뜻이었습니다. 그러니 장례식장에서 말실수하지 않도록 주의하세요. 제 아내가 일어나서 한 소리 할지도 모르니까요.\n\n주사위 굴리기, 떨어지는 새, 기어가는 벌레, 별들의 이동, 하늘에서 내리는 눈, 불어오는 바람, 시력을 잃은 사람, 고난받는 성도, 모든 이들의 죽음, 이것들은 이 말씀에 포함되어 있습니다. '내가 나의 모든 기뻐하는 것을 이루리라.' (이사야 46:10)\n\n\n"
}